{
  "assets": {
    "en": {
      "portfolio-title": "My Portfolio",
      "bio-sidebar": "I am an aspiring full-stack JavaScript developer from Gruenstadt, in Southwest Germany. I am passionate about JavaScript and building complex web applications.",
      "portfolio-description": "Welcome to my portfolio! View more information about each project by clicking on an image. Each project contains a description, screenshots, a live link to try it out and a link to the source code on Github. Feel free to get in touch. I would love to hear from you!",
      "back-button": "Back",
      "learn-more": "Learn More",
      "name": "Reinhard Liess",
      "job-title": "Full-Stack JavaScript Developer",
      "portfolio-bio": "I have a background in software development (mostly \"C\", database programming & some basic knowledge in HTML, CSS, JavaScript) and database administration (IBM DB2 UDB, Gupta SQLBase) but wanted to shift to become a full-stack Javascript developer, so I joined Treehouse's Techdegree program.<br><br>I have developed a deep understanding of JavaScript and how it works on both the client and server side and how the front- and backends interact. As a growing Full Stack Javascript Developer my goal is to create efficient and polished applications for potential clients using modern technologies while writing clean and easily maintainable code. I feel confident I could be a major asset to any development team.",
      "contact-info": "Contact info",
      "technologies": "Technologies",
      "skills": {
        "skills-text": "Skills",
        "skills-list": [
          "HTML",
          "CSS",
          "JavaScript",
          "Ajax/APIs",
          "OOP",
          "jQuery",
          "Node.js",
          "Express",
          "Pug",
          "SQL",
          "Git"
        ]
      },
      "error-handling": {
        "404": "The resource $1 can't be found on host $2"
      }
    },
    "de": {
      "portfolio-title": "Mein Portfolio",
      "bio-sidebar": "Ich bin ein ambitionierter JavaScript Full-Stack Entwickler aus Grünstadt, Rheinland-Pfalz, Deutschland. Meine große Leidenschaft ist es, komplexe Webanwendungen mit JavaScript zu erstellen.",
      "portfolio-description": "Willkommen auf meinem Portfolio! Sie können sich, erweiterte Informationen zu jedem Project anzeigen lassen, indem Sie auf ein Bild klicken. Für jedes Projekt existiert eine Beschreibung, Bildschirmfotos, ein Link, um das Projekt auszuprobieren und ein Link zum Quellcode auf Github. Zögern Sie nicht, sich mit mir in Verbindung, zu setzen. Ich würde mich sehr freuen, von Ihnen zu hören!",
      "back-button": "Zurück",
      "learn-more": "Mehr erfahren",
      "name": "Reinhard Ließ",
      "job-title": "Full-Stack JavaScript Entwickler",
      "portfolio-bio": "Ich habe Erfahrung im Bereich Softwareentwicklung (zum größte Teile \"C\", Datenbankprogrammierung und Grundlagen in HTML, CSS, JavaScript) und Datenbankadministration (IBM DB2 UDB, Gupta SQLBase), aber wollte mich verändern, um ein Full-Stack JavaScript Entwickler zu werden, deshalb habe ich mich für das \"Techdegree Progam\" von Treehouse eingeschrieben.<br><br>I habe ein tiefes Verständnis für JavaScript entwickelt und dafür, wie es sowohl auf dem Client, als auch auf dem Server, funktioniert und wie beide Seiten miteinander interagieren. Als ein stets dazulernender Full-Stack JavaScript Entwickler ist mein Ziel, effiziente und formvollendete Applikationen für potentielle Kunden, zu entwickeln indem ich sauberen und einfach wartbaren Programmcode schreibe. Ich bin zuversichtlich, dass ich eine bedeutsame Bereicherung für jedes Entwicklungsteam wäre.",
      "contact-info": "Kontakt",
      "technologies": "Technologien",
      "skills": {
        "skills-text": "Skills",
        "skills-list": [
          "HTML",
          "CSS",
          "JavaScript",
          "Ajax/APIs",
          "OOP",
          "jQuery",
          "Node.js",
          "Express",
          "Pug",
          "SQL",
          "Git"
        ]
      },
      "error-handling": {
        "404": "Die Resource $1 kann auf dem Host $2 nicht gefunden werden."
      }
    }
  },
  "projects": [
    {
      "id": 0,
      "en": {
        "project-name": "A Random Quote Generator",
        "description": "Using vanilla JavaScript, HTML and CSS I created an app that displays a random quote every time a button is pressed or after an interval of 10 seconds if the button isn't clicked. Some quotes have additional properties, like categorization tags and year. The same quote won't be displayed twice consecutively and the background color is randomly changed when the quote changes - the hue is randomized whereas the brightness and saturation are constant to make sure that the quote is always easily readable.",
        "technologies-list": [
          "HTML",
          "CSS",
          "JavaScript"
        ]
      },
      "de": {
        "project-name": "Ein Zufallsgenerator für Zitate",
        "description": "Mittels einfachem JavaScript, HTML und CSS habe ich eine App erstellt, die ein zufälliges Zitat jedes Mal anzeigt, wenn ein Button geklickt wurde oder nach einem Intervall von 10 Sekunden, falls kein Button geklickt wurde. Einige Zitate haben zusätzliche Eigenschaften, wie z. B. Kategorie oder Jahr. Dasselbe Zitat wird nicht zweimal hintereinander angezeigt und die Hintergrundfarbe wird zufällig geändert immer wenn auch das Zitat wechselt - der Farbton wird zufällig generiert, während die Helligkeit und Sättigung konstant gehalten werden, um sicherzustellen, dass das Zitat immer gut lesbar bleibt.",
        "technologies-list": [
          "HTML",
          "CSS",
          "JavaScript"
        ]
      },
      "live-link": "https://rliess.github.io/js-techdegree-project1/",
      "github-link": "https://github.com/rliess/js-techdegree-project1",
      "image-urls": [
        "/static/img/proj1-landing.jpg",
        "/static/img/proj1-screen1.jpg",
        "/static/img/proj1-screen2.jpg",
        "/static/img/proj1-screen3.jpg"
      ]
    },
    {
      "id": 1,
      "en": {
        "project-name": "List Pagination and Filtering",
        "description": "Browsing long lists doesn't provide a good user experience, so this app enhances the usability of a web page by paginating a long list of students into groups of ten students, dynamically adding buttons to the bottom of the page as needed. It does this by using unobtrusive JavaScript and progressive enhancement, so that the web site still works if JavaScript is turned off or isn't working properly. The instant search box filters the student directory in real time, creating the appropriate number of pagination buttons; if there's no search result, an error message is displayed on the page.",
        "technologies-list": [
          "HTML",
          "CSS",
          "JavaScript",
          "DOM manipulation"
        ]
      },
      "de": {
        "project-name": "Paginierung und Filtern einer Liste",
        "description": "Lange Listen durchzublättern ist nicht sehr benutzerfreundlich, deswegen verbessert diese App die Benutzerfreundlichkeit einer Webseite durch Paginierung einer langen Studentenliste in Gruppen von zehn Studenten, es werden dynamisch Buttons am unteren Rand der Seite generiert. Es wird progressive Verbesserung und unobtrusive JavaScript benutzt, so dass die Webseite auch funktioniert, wenn JavaScript abgeschaltet ist oder nicht einwandfrei funktioniert. Das Suchfeld filtert die Studentenliste in Echtzeit und erstellt dynamisch Buttons für die Paginierung. Falls die Suche keine Treffer liefert, wird eine entsprechende Fehlermeldung angezeigt.",
        "technologies-list": [
          "HTML",
          "CSS",
          "JavaScript",
          "DOM Manipulation"
        ]
      },
      "live-link": "https://rliess.github.io/js-techdegree-project2/",
      "github-link": "https://github.com/rliess/js-techdegree-project2",
      "image-urls": [
        "/static/img/proj2-landing.jpg",
        "/static/img/proj2-screen2.jpg",
        "/static/img/proj2-screen3.jpg"
      ]
    },
    {
      "id": 2,
      "en": {
        "project-name": "Interactive Form",
        "description": "This project enhances an interactive registration form for a fictional conference. I used the popular jQuery JavaScript library to validate user input and provide helpful error messages when the user enters invalid information into the form fields. All validation is performed dynamically, controlled by one array which contains all necessary regular expressions, validation messages and additional program logic where necessary.",
        "technologies-list": [
          "HTML",
          "CSS",
          "JavaScript",
          "jQuery",
          "Regular Expressions"
        ]
      },
      "de": {
        "project-name": "Interaktives Formular",
        "description": "Dieses Projekt verbessert ein interaktives Anmeldungsformular für eine fiktionale Konferenz. Ich habe die beliebte JavaScript Bibliothek jQuery benutzt, um Benutzereingaben zu validieren und Anwender zu unterstützen, wenn ungültige Werte in Formularfelder eingegeben werden. Alle Validierungen erfolgen dynamisch, gesteuert von einem Array, das alle notwendigen regulären Ausdrücke, Mitteilungen für den Anwender und zusätzliche Programmlogik, wo notwendig, enthält.",
        "technologies-list": [
          "HTML",
          "CSS",
          "JavaScript",
          "jQuery",
          "Reguläre Ausdrücke"
        ]
      },
      "live-link": "https://rliess.github.io/js-techdegree-project3/",
      "github-link": "https://github.com/rliess/js-techdegree-project3",
      "image-urls": [
        "/static/img/proj3-landing.jpg",
        "/static/img/proj3-screen1.jpg",
        "/static/img/proj3-screen2.jpg",
        "/static/img/proj3-screen3.jpg"
      ]
    },
    {
      "id": 3,
      "en": {
        "project-name": "Phrase Hunter Game",
        "description": "I used JavaScript and OOP (Object-Oriented Programming) to create a word guessing game: \"Phrase Hunter.\" When starting the game, a hidden, random phrase (of a list of five phrases) is chosen, and put onto the gameboard using placeholders. The player tries to guess a letter either by mouse or keyboard. The game tracks which phrases were guessed correctly and lets the player continue until all 5 phrases are guessed correctly.",
        "technologies-list": [
          "HTML",
          "CSS",
          "JavaScript",
          "OOP"
        ]
      },
      "de": {
        "project-name": "Redewendungen raten",
        "description": "Ich habe JavaScript und OOP (Objekt-orientierte Programmierung) benutzt, um ein Spiel zum Raten von Redewendungen zu erstellen: \"Phrase Hunter\". Nach dem Starten des Spiels, wird eine versteckte, zufällig ausgewählte Redewendung (von einer Liste von fünf Redewendungen) ausgewählt und auf dem virtuellen Spielbrett mit Platzhaltern angezeigt. Der Spieler versucht einen Buchstaben der Redewendung zu erraten, entweder mit Maus oder Tastatur. Das Spiel führt Buch darüber, welche Redewendungen richtig geraten wurden und lässt den Spieler weitermachen, bis alle fünf Redewendungen erraten wurden.",
        "technologies-list": [
          "HTML",
          "CSS",
          "JavaScript",
          "OOP"
        ]
      },
      "live-link": "https://rliess.github.io/js-techdegree-project4/",
      "github-link": "https://github.com/rliess/js-techdegree-project4",
      "image-urls": [
        "/static/img/proj4-landing.jpg",
        "/static/img/proj4-screen1.jpg",
        "/static/img/proj4-screen2.jpg",
        "/static/img/proj4-screen3.jpg"
      ]
    },
    {
      "id": 4,
      "en": {
        "project-name": "An Employee Directory",
        "description": "In this project I accessed the Random User API to retrieve information for 12 random \"employees\" and use that data to build a prototype for an employee directory of a fictional company called \"Awesome Startup\". When any part of an employee item in the directory is clicked, a modal window pops up displaying detailed information about that employee. I also implemented a search function by which the employee list can be filtered by name. Also, functionality has been added to switch back and forth between employees when the detail modal window is open, both in browse and search modes.",
        "technologies-list": [
          "HTML",
          "CSS",
          "JavaScript",
          "Fetch API",
          "JSON",
          "OOP"
        ]
      },
      "de": {
        "project-name": "Ein Mitarbeiterverzeichnis",
        "description": "In diesem Projekt habe ich auf das Random User API zugegriffen, um Informationen von 12 zufällig ausgewählten \"Mitarbeitern\" abzurufen und diese Daten zu benutzen, um einen Prototyp eines Mitarbeiterverzeichnisses einer fiktionalen Firma, genannt \"Awesome Startup\", zu erstellen. Immer wenn auf eine \"Karteikarte\" eines Mitarbeiters geklickt wird, erscheint ein modales Fenster, das detaillierte Informationen über den Mitarbeiter enthält. Ich habe auch eine Suchfunktion implementiert, wodurch die Mitarbeiterliste nach Namen gefiltert werden kann. Außerdem wurde die notwendige Funktionalität erstellt, um vorwärts und rückwärts zu blättern, während das modale Fenster angezeigt wird, sowohl im normalen Modus, als auch wenn ein Filter aktiv ist.",
        "technologies-list": [
          "HTML",
          "CSS",
          "JavaScript",
          "Fetch API",
          "JSON",
          "OOP"
        ]
      },
      "live-link": "https://rliess.github.io/js-techdegree-project5/",
      "github-link": "https://github.com/rliess/js-techdegree-project5",
      "image-urls": [
        "/static/img/proj5-landing.jpg",
        "/static/img/proj5-screen1.jpg",
        "/static/img/proj5-screen3.jpg"
      ]
    }
  ]
}